import 'package:sab/sab_types.dart';

const List<News> _allArNews = <News>[
  News(
      iD: 1,
      title:
          "ديوان المحاسبة يشارك في الاجتماع المشترك لمبادرة تنمية الانتوساي وإدارة الشؤون الاقتصادية والاجتماعية التابعة لهيئة الأمم المتحدة",
      date: "26 يوليه 2018",
      source: "المكتب الاعلامي",
      isUrgent: true,
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/ديوان%20المحاسبة%20يشارك%20في%20الاجتماع%20المشترك%20لمبادرة%20تنمية%20الانتوساي%20وإدارة%20الشؤون%20الاقتصادية%20والاجتماعية%20التابعة%20لهيئة%20الأمم%20المتحدة.jpg",
      description:
          "شارك وفد من ديوان المحاسبة برئاسة الشيخ فهد بن حمد آل ثاني مساعد رئيس الديوان لرقابة الأداء والالتزام، في الاجتماع المشترك لمبادرة تنمية الانتوساي وإدارة الشؤون الاقتصادية والاجتماعية التابعة لهيئة الأمم المتحدة الذي عقد يومي 19 و 20 يوليو 2018 في مقر هيئة الأمم المتحدة في نيويورك. وناقش الاجتماع موضوع مساهمة الأجهزة العليا للرقابة في تحقيق أهداف التنمية المستدامة، كما هدف الاجتماع إلى تبادل المعارف والخبرات في مجال تحقيق أهداف التنمية المستدامة."),
  News(
      iD: 2,
      title: "ورشة تعريفية للتدريب الميداني لطالبات جامعة قطر",
      date: "01 يوليه 2018",
      source: "المكتب الاعلامي",
      isUrgent: false,
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/SAB%20Tower.jpg",
      description: ""),
  News(
      iD: 3,
      title: "مركز التميز للتدريب والتطوير يختتم برنامج المعينين الجدد",
      date: "27 سبتمبر 2017	",
      imageUrl: "",
      isUrgent: false,
      source: "الجزيرة",
      description:
          "اختتم مركز التميز للتدريب والتطوير برنامج المعينين الجدد بديوان المحاسبة، والذي جرى خلال الفترة من 25 – 27 سبتمبر 2017. وهدف البرنامج إلى تعريف الموظفين الجدد بقانون ديوان المحاسبة وقيم واخلاقيات العمل."),
  News(
      iD: 4,
      title:
          "ديوان المحاسبة يختتم البرنامج التدريبي لموظفي وزارة الاقتصاد والتجارة",
      date: "18 مايو 2017",
      source: "المكتب الاعلامي",
      isUrgent: false,
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/ديوان%20المحاسبة%20يختتم%20البرنامج%20التدريبي%20لموظفي%20وزارة%20الاقتصاد%20والتجارة1.jpg",
      description:
          "نظم مركز التميز للتدريب والتطوير بديوان المحاسبة دورة تدريبية لموظفي وزارة الاقتصاد والتجارة تحت عنوان (عناصر المعرفة الخاصة بالتدقيق الداخلي) وذلك يومي 24 - 25 من يوليو الحالي. وتأتي هذه الدورة ضمن الخطة التدريبية لموظفي وزارة الاقتصاد والتجارة التي يقوم بها مركز التميز للتدريب والتطوير، حيث نفذ المركز عدة دورات تدريبية لموظفي وزارة الاقتصاد والتجارة والتي يسعى من خلالها مركز التميز للتدريب والتطوير إلى تأهيل وتطوير كوادر الجهات الخاضعة لرقابة ديوان المحاسبة. وهدف البرنامج التدريبي إلى تعريف المشاركين بأدوات المعرفة الخاصة بالتدقيق الداخلي والتأكيد على أهمية رفع جودة تقارير التدقيق والتأكد من اكتمال صحة الوارد فيها وانسجامها مع أهم معايير التدقيق الدولية المعتمدة والقوانين ذات الصلة."),
  News(
      iD: 5,
      title:
          "رئيس ديوان المحاسبة يصدر قرارات بتعيين مساعدين للرئيس بدرجة وكيل وزارة مساعد",
      date: "19 فبراير 2017",
      isUrgent: false,
      source: "تليفزيون قطر",
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/صورة%20الرئيس%20المعتمدة.JPG",
      description:
          "  قرار رقم (21 لسنة 2017) بتعيين السيد عبدالعزيز بن محمد آل خليفة مساعداً للرئيس لرقابة المشاريع والعقود وبدرجة وكيل وزارة مساعد .أصدر سعادة الشيخ بندر بن محمد بن سعود ال ثاني – رئيس ديوان المحاسبة قرارات بتعيين مساعدين للرئيس بدرجة وكيل وزارة مساعد ، حيث تضمنت القرارات ما يلي"),
];

const List<Events> _events = <Events>[
  Events(
      title:
          "الاجتماع الخامس والخمسين للمجلس التنفيذي للمنظمة العربية للأجهزة العليا للرقابة المالية والمحاسبة",
      description:
          "يستضيفه ديوان المحاسبة  في دولة قطر الاجتماع الخامس والخمسين للمجلس التنفيذي للمنظمة العربية للأجهزة العليا للرقابة المالية والمحاسبة(الأربوساي) خلال الفترة 28ـ29 مارس 2017 في الدوحة .",
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/logoPortal.png",
      fromDate: "28 مارس 2017",
      toDate: "29 مارس 2017 "),
  Events(
      title: "الملتقى العربي الأوربي الخامس",
      description:
          "يعقد الملتقى العربي الأوربي كل عامين بالتناوب بين أجهزة الرقابة العربية والأوربية، ويهدف الملتقى إلى تعزيز التعاون الفني والمؤسسي بين الأجهزة العليا للرقابة في الدول العربية والدول الأوربية",
      imageUrl:
          "https://www.sab.gov.qa/Arabic/Media/News/PublishingImages/صورة%20جماعية.jpg",
      fromDate: "07 ديسمبر 2015",
      toDate: "09 ديسمبر 2015")
];

int _counter = -1;
List<ListItem> allData =
    List<ListItem>.generate(_allArNews.length + _events.length, (i) {
  if (i < _allArNews.length) {
    return _allArNews[i];
  } else {
    _counter++;
    return _events[_counter];
  }
});
